<?php

const ERROR = [
  '101' => 'メールアドレスを入力してください',
  '102' => '正しいメールアドレスを入力してください',
  '103' => 'そのメールアドレスは既に使われています',
  '201' => 'ユーザーIDを入力してください',
  '202' => 'そのユーザーIDは既に使われています',
  '203' => 'ユーザーIDが間違っています',
  '301' => 'パスワードを入力してください',
  '302' => 'パスワードは8文字以上で設定してください',
  '303' => '英数字最低でもそれぞれ1文字ずつ使用してください',
  '304' => 'パスワードが間違っています',
  '401' => '氏名を入力してください',
  '501' => 'フリガナを入力してください',
  '502' => '店舗説明を入力してください',
  '601' => '郵便番号を入力してください',
  '701' => '都道府県,市町村を入力してください',
  '801' => '番地,号を入力してください',
  '901' => '電話番号を入力してください',
  '1001' => '商品名を入力してください',
  '1002' => '説明を入力してください',
  '1003' => '現在価格を入力してください',
];

?>